<!-- attach-outputs:plan-nodes-test.txt -->
  <!-- Output: plan-nodes-test.txt -->
  #### plan-nodes-test.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 20, 2026, 06:42 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cluster.module.talos-vm["tiles-test-cp"].talos_machine_configuration_apply.this will be updated in-place
  ~ resource "talos_machine_configuration_apply" "this" {
        id                          = "machine_configuration_apply"
      + resolved_apply_mode         = "auto"
        # (7 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.192.11"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-test-cp.local.symmatree.com."
      + mac                    = "bc:24:11:d0:74:11"
      + name                   = "tiles-test-cp"
      + network_id             = "643f0d49364f930b6077d96c"
      + note                   = "Control - 7411 - tiles-test-cp"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].talos_machine_configuration_apply.this will be updated in-place
  ~ resource "talos_machine_configuration_apply" "this" {
        id                          = "machine_configuration_apply"
      + resolved_apply_mode         = "auto"
        # (7 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.192.21"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-test-wk.local.symmatree.com."
      + mac                    = "bc:24:11:d0:74:21"
      + name                   = "tiles-test-wk"
      + network_id             = "643f0d49364f930b6077d96c"
      + note                   = "Worker - 7421 - tiles-test-wk"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

Plan: 2 to add, 2 to change, 0 to destroy.

  ```

  </details>
  
  